RubyProject/app/models/company.rb

UPDATE "companies" SET "updated_at" = $1, "deleted" = $2 WHERE "companies"."id" = $3  [["updated_at", "2023-10-01 15:22:18.882907"], ["deleted", true], ["id", 2]]
---
  def delete_company
    self.update(deleted: true)