RubyProject/app/controllers/api/v1/companies_controller.rb

  def mark_deleted #destroy
    company = Company.find(params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]