RubyProject/app/graphql/types/mutation_type.rb

INSERT INTO "resorts" ("name", "email", "description") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Hannila"], ["email", "anna@mail.ru"], ["description", nil]]
---
    def createResort(name:, email:)
      new_resort = Resort.create(name: name, email: email)

INSERT INTO "apartments" ("room_type", "description", "resort_id") VALUES ($1, $2, $3) RETURNING "id"  [["room_type", "Single Room"], ["description", "A very alone"], ["resort_id", 3]]
---
    def createApartment(room_type:, description:, resort_id:)
      new_apartment = Apartment.create(
        room_type: room_type, description: description, resort_id: resort_id)