RubyProject/app/graphql/types/query_type.rb

    def resort(id:)
      Resort.find(id)
---
SELECT "resorts".* FROM "resorts" WHERE "resorts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def apartment(id:)
      Apartment.find(id)
---
SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]